'''问题1
编写一个程序，查找所有可以被7整除但不是5的倍数的数字。在2000到3200之间（均包括在内）。所获得的数字应以逗号分隔的顺序打印在一行上。

提示： 
考虑使用范围（＃begin，＃end）方法'''

# list1 = []

# for i in range(2000,3201):
#     if i%7 ==0 and i%5 !=0:
#         list1.append(i)
# for i in list1:
#     print(i,end=',') 


'''问题2
编写一个程序，可以计算给定数字的阶乘。结果应以逗号分隔的顺序打印在一行上。
假设将以下输入提供给程序：8 然后，输出应为：40320

提示：
如果将输入数据提供给问题，则应假定它是控制台输入。'''

# while True:
#     a = int(input("请输入一个数:"))
#     b = 1
#     if a ==0:
#         print (0)
#     else:
#         for i in range(1,a+1):
#             b=b*i
#         print(b)

'''问题3
使用给定的整数n，编写程序以生成包含（i，i * i）的字典，该字典为1到n之间的整数（都包括在内）。然后程序应打印字典。
假设将以下输入提供给程序：8
然后，输出应为：{1：1、2：4、3：9、4：16、5：25、6：36、7：49、8：64}

提示：
如果将输入数据提供给问题，则应假定它是控制台输入。
考虑使用dict（）'''

# n = int(input("请输入一个数字："))
# dict_a = {}
# for i in range (1,n+1):
#     dict_a[i] = i*i
# print(dict_a)

''' 
问题4
编写一个程序，该程序从控制台接受一个逗号分隔的数字序列，并生成一个列表和一个包含每个数字的元组。
假设将以下输入提供给程序：34,67,55,33,12,98
然后，输出应为：
['34'，'67'，'55'，'33'，'12'，'98']
（“ 34”，“ 67”，“ 55”，“ 33”，“ 12”，“ 98”）

提示：
如果将输入数据提供给问题，则应假定它是控制台输入。
tuple（）方法可以将列表转换为元组 
'''

a = input("请输入6个数字，每个数字以空格为分隔符：")
l = a.split()
t = tuple(l)
print(l)
print(t)

'''
问题5
定义一个至少具有两个方法的类：getString：从控制台输入获取字符串printString：以大写形式输出字符串。还请包括简单的测试功能来测试类方法。

提示：
使用__init__方法构造一些​​参数
'''